MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512ZVLK10/mcu.h
#define TAIE                          0x00000004      // Time Alarm Interrupt Enable
#define TOIE                          0x00000002      // Time Overflow Interrupt Enable
#define TIIE                          0x00000001      // Time Invalid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_WAR register.
//
//*****************************************************************************

#define IERW                          0x00000080      // Interrupt Enable Register Write
#define LRW                           0x00000040      // Lock Register Write
#define SRW                           0x00000020      // Status Register Write
#define CRW                           0x00000010      // Control Register Write
#define TCRW                          0x00000008      // Time Compensation Register Write
#define TARW                          0x00000004      // Time Alarm Register Write
#define TPRW                          0x00000002      // Time Prescaler Register Write
#define TSRW                          0x00000001      // Time Seconds Register Write


//*****************************************************************************
//
// The following are defines for the bit fields in the RTC_RAR register.
//
//*****************************************************************************

#define IERR                          0x00000080      // Interrupt Enable Register Read
#define LRR                           0x00000040      // Lock Register Read
#define SRR                           0x00000020      // Status Register Read
#define CRR                           0x00000010      // Control Register Read
#define TCRR                          0x00000008      // Time Compensation Register Read
#define TARR                          0x00000004      // Time Alarm Register Read
#define TPRR                          0x00000002      // Time Prescaler Register Read
#define TSRR                          0x00000001      // Time Seconds Register Read


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR0 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR0 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR0 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR1 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR1 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR1 register.
//
//*****************************************************************************

#define AROFFSETOFFSET                0x80000000      // Address offset enable
#define AROFFSETOFFSET                0x40000000      // Address offset size
#define BURST                         0x20000000      // Burst mode enable
#define WAITENA                       0x10000000      // Wait enable
#define WAITCNT                       0x78000000      // Wait count
#define EXRW                          0x00800000      // Extended read/write
#define WRACC                         0x00400000      // Write access
#define RDACC                         0x00200000      // Read access
#define AA                            0x00100000      // Auto-acknowledge enable
#define PCSISWIDTH                    0x00780000      // Chip select width
#define BL                            0x007F8000      // Burst length
#define WRTHRESHWRTHRESH              0x00007F80      // Write threshold


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSAR2 register.
//
//*****************************************************************************

#define BASE_ADDR                     0x7FFFFFFF80000000      // Chip select address register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMR2 register.
//
//*****************************************************************************

#define MASK                          0x7FFFFFFF80000000      // Chip select mask register


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCR2 register.
//
//*****************************************************************************

